'use strict'
let a = 1, b = 1, c, d;
/*Знаки + стоят перед переменной а (префиксная форма), поэтому она сначала увеличивается, а потом задается значение для с*/
c = ++a;
alert(c); // ответ: 2     

/*Знаки + стоят после переменной b (постфиксная форма), поэтому  сначала присваивается значение b для d, а потом b увеличивается на 1 */
d = b++;
alert(d); //ответ: 1

/*Переменная а уже имеет значение "2" после первого примера, в префиксной форме сразу увеличивается до трех, затем сложение 2 и 3, итого с равно 5*/
c = 2 + ++a;
alert(c); //ответ: 5

/*Переменная b уже имеет значение "2" после второго примера, сейчас в постфиксной форме. 2 и 2 складываются, результат присваивается d, b увеличивается на 1. а и b теперь равно трем  */
d = 2 + b++;
alert(d); //ответ: 4

alert(a); //3
alert(b); //3